InformationRegisters/Звонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Звонки</Name>
			<Comment>Реестр входящих и исходящих звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время выполнения звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер телефонии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Comment>Индикатор состоявшегося звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Инициатор звонка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Comment>Имя файла с записью звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Comment>Направление звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнутренний</Name>
					<Comment>Телефон внутреннего абонента завершившего звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок помещен в очередь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВыходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок был в очереди, когода абонент прервал вызов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Comment>Тип значения строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Звонки/Forms/ФормаСпискаСАнкетой/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Если текущий пользователь не является Администратором, то отобразим в Списке только те звонки,
// которые поступили на подразделения и абонентов доступных текущему пользователю
//-------------------------------------------------------------------------------------------------
	Если (НЕ ПараметрыСеанса.РольДоступнаАдминистратор) Тогда
		ТекстЗапроса = " И (Стат.ИнициаторИсходящего В ИЕРАРХИИ (&Подразделения) ИЛИ Стат.Исполнитель В ИЕРАРХИИ (&Подразделения))";
		ЭтаФорма.Список.ТекстЗапроса = СокрЛП(ЭтаФорма.Список.ТекстЗапроса) + Символы.ПС + ТекстЗапроса;

		ДоступныеПодразделения = ЗначенияСервера.ДоступныеПодразделения();
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Подразделения",ДоступныеПодразделения);
	КонецЕсли;
	
	// Установи вопрос в качестве заголовка колонки Ответ
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|	ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос_Анкеты_Для_Полного_Реестра_Звонков""";
	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ.Заголовок = Вопрос;	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос", Выборка.Вопрос);
	
	// Установи вопрос1 в качестве заголовка колонки Ответ1
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|	ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос1_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос1 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ1.Заголовок = Вопрос1;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос1", Выборка.Вопрос);

	// Установи вопрос2 в качестве заголовка колонки Ответ2
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос2_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос2 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ2.Заголовок = Вопрос2;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос2", Выборка.Вопрос);

	// Установи вопрос3 в качестве заголовка колонки Ответ3
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос3_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос3 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ3.Заголовок = Вопрос3;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос3", Выборка.Вопрос);
	
	// Установи вопрос4 в качестве заголовка колонки Ответ4
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос6_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос6 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ6.Заголовок = Вопрос6;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос6", Выборка.Вопрос);

// Установи вопрос5 в качестве заголовка колонки Ответ4
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос7_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос7 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ7.Заголовок = Вопрос7;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос7", Выборка.Вопрос);

	//Период
	//--------
	ТекДата 	= ТекущаяДата();
	Окончание 	= КонецДня(ТекДата);
	Начало 		= НачалоДня( НачалоДня(ТекДата)-1);
	
	Период.ДатаНачала 		= Начало;
	Период.ДатаОкончания 	= Окончание;
	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 		Период.ДатаНачала);
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 	Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение();
	Элементы.ВыборПериода.Заголовок = " "+Формат(Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Период.ДатаОкончания, "ДЛФ=Д");
	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 		Период.ДатаНачала);
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 	Период.ДатаОкончания);
	Элементы.Список.Обновить();
КонецПроцедуры

#Область Выбор_Периода
&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Период;
	
	Оп = Новый ОписаниеОповещения("НаЗакрытиеДиалогаПериода", ЭтаФорма);
	Диалог.Показать(Оп);
КонецПроцедуры

&НаКлиенте
Процедура НаЗакрытиеДиалогаПериода(Парам1, Парам2) Экспорт
	Если Парам1 = Неопределено Тогда
		Возврат
	КонецЕсли;
	Период = Парам1;
	ОбновитьОтображение();
КонецПроцедуры
#КонецОбласти
